app/views/mesas/_form_cancelar.html.erb

SELECT  `users`.* FROM `users`  ORDER BY `users`.`id` ASC LIMIT 1
---
		<div class="thumbnail">
			<% codigo = User.first_or_create %>