app/views/mesas/index.html.erb

          <tr>
            <% codigo = User.first_or_create %>
---
SELECT  `users`.* FROM `users`  ORDER BY `users`.`id` ASC LIMIT 1