app/controllers/mesas_controller.rb

SELECT  `mesas`.* FROM `mesas` WHERE `mesas`.`id` = 2 LIMIT 1
---
  def show
    @mesas = Mesa.find(params[:id])

SELECT  `mesas`.* FROM `mesas` WHERE `mesas`.`id` = 2 LIMIT 1
---
  def edit
    @mesas = Mesa.find(params[:id])

UPDATE `mesas` SET `reservada` = 1, `updated_at` = '2017-01-15 00:17:04' WHERE `mesas`.`id` = 2
SELECT  `users`.* FROM `users`  ORDER BY `users`.`id` ASC LIMIT 1
SELECT  1 AS one FROM `mesas` WHERE (`mesas`.`codigo` = 'MESA0002' AND `mesas`.`id` != 2) LIMIT 1
---
  def update
    respond_to do |format|
      if @mesa.update(mesa_params)
        format.html { redirect_to @mesa, notice: 'Mesa atualizada com sucesso.' }
        format.json { render :show, status: :ok, location: @mesa }
      else
        format.html { render :edit }
        format.json { render json: @mesa.errors, status: :unprocessable_entity }
      end
    end
    users = User.first_or_create
    if users.mesa_codigo.blank?

SELECT  `mesas`.* FROM `mesas` WHERE `mesas`.`id` = 2 LIMIT 1
---
    def set_mesa
      @mesa = Mesa.find(params[:id])